app/controllers/api/v1/groups_controller.rb

  def index
    @resources = Company.select("groups.id, groups.name, companies.id company_id, companies.code company_code, companies.name company_name").joins(:groups)
---
SELECT "companies"."id" AS t0_r0, "companies"."code" AS t0_r1, "companies"."name" AS t0_r2, "companies"."created_at" AS t0_r3, "companies"."updated_at" AS t0_r4, "groups"."id" AS t1_r0, "groups"."name" AS t1_r1, "groups"."company_id" AS t1_r2, "groups"."created_at" AS t1_r3, "groups"."updated_at" AS t1_r4 FROM "companies" INNER JOIN "groups" ON "groups"."company_id" = "companies"."id"

  def create
    if @company.present?
      group = @company.groups.build(resource_params)
      if group.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."company_id" = $1  [["company_id", nil]]
INSERT INTO "groups" ("name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "testGroup"], ["company_id", 4], ["created_at", "2022-07-17 13:45:45.629231"], ["updated_at", "2022-07-17 13:45:45.629231"]]

  def group_list
    list = Group.
      select('groups.id, groups.name, companies.code').
      joins(:company).
      left_joins(:user_groups).
      group('groups.id, companies.code, groups.name, user_groups.group_id').
      order('groups.id').
      page(@page).
      per(@size)
---
SELECT COUNT(*) AS "count_all", groups.id, companies.code, groups.name, user_groups.group_id AS "groups_id_companies_code_groups_name_user_groups_group_id" FROM "groups" INNER JOIN "companies" ON "companies"."id" = "groups"."company_id" LEFT OUTER JOIN "user_groups" ON "user_groups"."group_id" = "groups"."id" GROUP BY groups.id, companies.code, groups.name, user_groups.group_id
SELECT groups.id, groups.name, companies.code FROM "groups" INNER JOIN "companies" ON "companies"."id" = "groups"."company_id" LEFT OUTER JOIN "user_groups" ON "user_groups"."group_id" = "groups"."id" GROUP BY groups.id, companies.code, groups.name, user_groups.group_id ORDER BY groups.id LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def get_company
    begin
			@company = Company.find(params[:group][:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]