app/controllers/api/v1/users_controller.rb

SELECT users.id, companies.code company_code, companies.name company_name, groups.name group_name, users.email, users.first_name, users.last_name, users.age FROM "users" INNER JOIN "companies" ON "companies"."id" = "users"."company_id" LEFT OUTER JOIN "user_groups" ON "user_groups"."user_id" = "users"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "user_groups"."group_id"
---
  def index
    @resources = User.select("users.id, companies.code company_code, companies.name company_name, groups.name group_name, users.email, users.first_name, users.last_name, users.age").joins(:company).left_joins(:group)

INSERT INTO "users" ("email", "first_name", "last_name", "age", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["email", "aaa@a.com"], ["first_name", "test1"], ["last_name", "first"], ["age", nil], ["company_id", 4], ["created_at", "2022-07-18 04:50:07.838475"], ["updated_at", "2022-07-18 04:50:07.838475"]]
---
  def create
    if @company.present?
      user = @company.users.build(resource_params)
      if user.save

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."company_id" = $1 AND "groups"."id" = $2  [["company_id", 1], ["id", 1]]
UPDATE "users" SET "email" = $1, "first_name" = $2, "last_name" = $3, "age" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["email", "aaa@aa.com"], ["first_name", "test"], ["last_name", "1"], ["age", "19"], ["updated_at", "2022-07-18 05:29:19.942424"], ["id", 1]]
INSERT INTO "user_groups" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 1], ["user_id", 1], ["created_at", "2022-07-19 14:14:27.991549"], ["updated_at", "2022-07-19 14:14:27.991549"]]
---
  def assign_group
    render json: { errors: 'Bad Request' }, status: 400 if params[:user_id].blank? || params[:user_id].blank?

    if @user.user_group.present?
      render json: { errors: I18n.t('messages.already_added', resource: 'Group') }, status: 400
    else
      company = @user.company&.groups&.where(id: params[:group_id])
      if company.present?
        group = @user.build_user_group(group_id: params[:group_id])
        if group.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_company
    begin
			@company = Company.find(params[:user][:company_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_user
    @user = User.find(params[:user_id])